"""
Задача 3.
Задайте список вещественных числе.
Напишите программу которая найдет разницу межде максимальным и мнимальным значением дробной части элементов.
Пример:
[1.1, 1.2, 3.1, 5.17, 10.02]
[4.07, 5.1, 8.2444, 6.98]

"""

example1 = [1.1, 1.2, 3.1, 5.17, 10.02]
example2 = [4.07, 5.1, 8.2444, 6.98]

def get_fraction(values):
    for v in values:
        print(с)
